#include <stdio.h>

#define N 8  // 節点の数

int a[N+1][N+1] = {{0, 0, 0, 0, 0, 0, 0, 0, 0},  // 非連結グラフを表す隣接行列
                   {0, 0, 1, 1, 0, 0, 0, 0, 0},
                   {0, 1, 0, 1, 1, 0, 0, 0, 0},
                   {0, 1, 1, 0, 0, 1, 0, 0, 0},
                   {0, 0, 1, 0, 0, 1, 0, 0, 0},
                   {0, 0, 0, 1, 1, 0, 0, 0, 0},
                   {0, 0, 0, 0, 0, 0, 0, 1, 1},
                   {0, 0, 0, 0, 0, 0, 1, 0, 1},
                   {0, 0, 0, 0, 0, 0, 1, 1, 0}};

int v[N+1];  // 訪問済み判定 (訪問済を1とする)

void visit(int);

void main(void) {

    int count = 1;  // 連結成分の個数

    // 訪問済み判定配列の初期化
    for(int i=1; i<=N; i++) {
        v[i] = 0;
    }

    // 節点1から走査
    for(int i=1; i<=N; i++) {
        if(v[i] != 1) {  // 訪問済みでなければ訪問
            printf("%d : ", count++);  // 連結成分を表示
            visit(i);
            printf("\n");
        }
    }
}

// 節点iから探索する 
void visit(int i) {

    printf("%d ", i);
    v[i] = 1;  // 訪問済みとする

    for(int j=1; j<=N; j++) {
        if(a[i][j] == 1 && v[j] == 0) {  // 連結かつ未訪問
            visit(j);
        }
    }
}
